Table of Contents
 Class IdeaMaterialConcrete
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaMaterialConcrete : AbstractIdeaObject<IIdeaMaterialConcrete>, IEquatable<AbstractIdeaObject<IIdeaMaterialConcrete>>, IIdeaMaterialConcrete, IIdeaMaterial, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaMaterialConcrete>
IdeaMaterialConcrete
Implements
IEquatable<AbstractIdeaObject<IIdeaMaterialConcrete>>
IIdeaMaterialConcrete
IIdeaMaterial
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaMaterialConcrete>.Id
 AbstractIdeaObject<IIdeaMaterialConcrete>.Name
 AbstractIdeaObject<IIdeaMaterialConcrete>.Identifier
 AbstractIdeaObject<IIdeaMaterialConcrete>.GetHashCode()
 AbstractIdeaObject<IIdeaMaterialConcrete>.Equals(object)
 AbstractIdeaObject<IIdeaMaterialConcrete>.Equals(AbstractIdeaObject<IIdeaMaterialConcrete>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaMaterialConcrete(Identifier<IIdeaMaterialConcrete>)
public IdeaMaterialConcrete(Identifier<IIdeaMaterialConcrete> identifer)
Parameters
identifer Identifier<IIdeaMaterialConcrete>
 IdeaMaterialConcrete(int)
public IdeaMaterialConcrete(int id)
Parameters
id int
 IdeaMaterialConcrete(string)
public IdeaMaterialConcrete(string id)
Parameters
id string
Properties
 Material
Parameters of the material.
public virtual MatConcrete Material { get; set; }
Property Value
MatConcrete
 Edit this page